BracketRacket/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)
        @user.league_id = rand(1..1000000000)

        if @user.save
---
INSERT INTO "users" ("username", "team_id", "current_season", "league_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["username", "Malacboii"], ["team_id", nil], ["current_season", nil], ["league_id", 801496021], ["created_at", "2023-01-22 04:51:05.501588"], ["updated_at", "2023-01-22 04:51:05.501588"]]